tutorials/modules/multiRegion/CHT/heatExchanger/system/air/topoSetDict.2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // rotor cell zone
    {
        name    rotorCells;
        type    cellSet;
        action  new;
        source  zoneToCell;
        zone    cylinder;
    }
    {
        name    rotorCells;
        type    cellSet;
        action  add;
        source  zoneToCell;
        zone    innerCylinder;
    }
    {
        name    rotorCells;
        type    cellSet;
        action  subset;
        source  boxToCell;
        box (-100 -100 0.1) (100 100 0.15);
    }
    {
        name    rotor;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set rotorCells;
    }
);


// ************************************************************************* //
